import { useState } from "react";
import Image from "next/image";
import Button from "@/components/common/Button";
import BannerSlider from "@/components/common/BannerSlider";
import { bannerImages } from "@/constants/bannerImages";

export default function FaqDesktop() {
  const [openItems, setOpenItems] = useState(new Set());

  const toggleItem = (index) => {
    const newOpenItems = new Set(openItems);
    if (newOpenItems.has(index)) {
      newOpenItems.delete(index);
    } else {
      newOpenItems.add(index);
    }
    setOpenItems(newOpenItems);
  };

  return (
    <div className="h-full w-full block sm:hidden">
      <BannerSlider images={bannerImages} width="90rem" />
      <div className="flex flex-col gap-4 p-4">
        {faqItems.map((item, index) => (
          <div key={index} className="flex items-center gap-2">
            <button
              onClick={() => toggleItem(index)}
              className="flex justify-center items-center max-h-[150px] px-3 rounded-lg bg-[#FFFF00]"
            >
              <h3
                className="text-[10px] font-bold text-black pl-2 py-3"
                style={{
                  writingMode: "vertical-lr",
                  textOrientation: "upright",
                }}
              >
                {item.title}
              </h3>
            </button>

            <p
              className="text-[10px] max-h-[150px] w-full overflow-x-auto"
              style={{
                writingMode: "vertical-lr",
                textOrientation: "upright",
              }}
            >
              {item.description}
            </p>
          </div>
        ))}
      </div>
    </div>
  );
}

const faqItems = [
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠰᠣᠶᠤᠯ᠂ ᠪᠣᠯᠪᠠᠰᠤᠷᠠᠯ ᠢ᠋ ᠲᠦᢉᠡᢉᠡᠨ ᠳᠡᠯᢉᠡᠷᠡᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠰᠣᠶᠤᠯ᠂ ᠪᠣᠯᠪᠠᠰᠤᠷᠠᠯ ᠢ᠋ ᠲᠦᢉᠡᢉᠡᠨ ᠳᠡᠯᢉᠡᠷᠡᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠰᠣᠶᠤᠯ᠂ ᠪᠣᠯᠪᠠᠰᠤᠷᠠᠯ ᠢ᠋ ᠲᠦᢉᠡᢉᠡᠨ ᠳᠡᠯᢉᠡᠷᠡᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠰᠣᠶᠤᠯ᠂ ᠪᠣᠯᠪᠠᠰᠤᠷᠠᠯ ᠢ᠋ ᠲᠦᢉᠡᢉᠡᠨ ᠳᠡᠯᢉᠡᠷᠡᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠰᠣᠶᠤᠯ᠂ ᠪᠣᠯᠪᠠᠰᠤᠷᠠᠯ ᠢ᠋ ᠲᠦᢉᠡᢉᠡᠨ ᠳᠡᠯᢉᠡᠷᠡᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
  {
    title: "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠶᠠᠭᠤ ᢈᠢᠳᠡᢉ ᠪᠤᠢ",
    description:
      "ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠰᠢᠨ᠋ᠯ ᠨᠢ ᢈᠦᠮᠦᠨ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠨᠢ ᠡᠳ᠋ᠯᠡᢉᠦᠯᢈᠦ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᢈᠦᠮᠦᠰ ᠦ᠋ᠨ ᢈᠦᠮᠦᠨᠯᠢᢉ ᠰᠡᠳᢈᠢᠯ ᠳ᠋ᠦ ᠲᠤᠯᠭᠠᠭᠤᠷᠢᠯᠠᠨ ᠻᠠᠮᠫᠠᠨᠢᠲᠤ ᠠᠵᠢᠯ ᠥᠷᠨᠢᢉᠦᠯᠳᠡᢉ ᠑᠕᠐ ᠭᠠᠷᠤᠢ ᠣᠷᠤᠨ ᠢ᠋ ᠬᠠᠮᠤᠷᠤᠭᠰᠠᠨ ᠑᠐ ᠰᠠᠶ᠎ᠠ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠴᠢᠳ ᠢ᠋ ᠡᠩᠨᠡᢉᠡᠨ ᠳ᠋ᠦ ᠪᠡᠨ ᠨᠢᢉᠡᠳᢈᠡᢉᠰᠡᠨ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷᢈᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠤ᠋ᠨ ᢈᠥᠳᠡᠯᢉᠡᢉᠡᠨ ᠶᠠᠭᠤᠮ᠎ᠠ᠃  ᠪᠢᠳᠡ ᠳᠡᠯᠡᢈᠡᠢ ᠥᠨᠴᠦᢉ ᠪᠤᠯᠤᠩ ᠪᠦᠷᠢ ᠳ᠋ᠦ ᠪᠤᠢ ᠡᠷᠦᠰᠳᠡᠯ ᠳ᠋ᠦ ᠪᠤᠢ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠢ᠋ ᠬᠠᠮᠠᠭᠠᠯᠠᠵᠤ ᠠᠵᠢᠯᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠵᠡᠷᢉᠡᠴᠡᢉᠡ ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠲᠤ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠰᠣᠶᠤᠯ᠂ ᠪᠣᠯᠪᠠᠰᠤᠷᠠᠯ ᠢ᠋ ᠲᠦᢉᠡᢉᠡᠨ ᠳᠡᠯᢉᠡᠷᠡᢉᠦᠯᢈᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠬᠠᠮᠠᠭᠠᠯᠠᠭᠴᠢᠳ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ᠂ ᠴᠢᠳᠠᠪᠤᠷᠢᠵᠢᠭᠤᠯᠬᠤ᠂ ᠠᠶᠤᠯ ᠡᠷᠦᠰᠳᠡᠯ ᠦᢉᠡᠢ ᠨᠥᢈᠦᠴᠡᠯ ᠳ᠋ᠦ ᠠᠵᠢᠯ ᢈᠥᠳᠡᠯᠮᠦᠷᠢ ᠪᠡᠨ ᠡᠷᢈᠢᠯᠡᢈᠦ ᠨᠥᢈᠦᠴᠡᠯ ᠢ᠋ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠬᠠᠤᠯᠢ ᠡᠷᢈᠡ ᠵᠦᠢ ᠶ᠋ᠢᠨ ᠣᠷᠴᠢᠨ ᠢ᠋ ᠰᠠᠶᠢᠵᠢᠷᠠᠭᠤᠯᠬᠤ ᠴᠢᢉᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠠᠵᠢᠯᠯᠠᠵᠤ ᠪᠠᠶᠢᠨ᠎ᠠ᠃",
  },
];
