import BannerSlider from "@/components/common/BannerSlider";
import { bannerImages } from "@/constants/bannerImages";
import SectionTitle from "@/components/common/SectionTitle";
import Image from "next/image";

export default function StructureManagersMobile() {
  // Static managers data
  const managers = [
    {
      id: 1,
      name: "Р. Очирбал",
      position: "Удирдах зөвлөлийн дарга",
      description:
        "Отгонтэнгэр их сургуулийн Хууль зүйн сургуульд багшилдаг. Хуульч, өмгөөлөгчөөр ажилладаг. Эмнестигийн үйл ажиллагаанд сүүлийн 10 гаруй жилийн хугацаанд идэвхтэй оролцож, Хуульчдын бүлгийн ахлагч, 2019 оноос Удирдах зөвлөлийн гишүүн, 2023 оны 9 дүгээр сараас Удирдах зөвлөлийн сонгогдон даргаар ажиллаж байна. Хүний эрх, эрх чөлөөний асуудал ялангуяа шинэ тутам үүсэж байгаа хүний эрхийн асуудлууд тухайлбал, уур амьсгалын өөрчлөлт ба хүний эрх, Бизнес ба хүний эрх, Технологи ба хүний эрх, Онц байдал ба Хүний эрх, Татвар ба Хүний эрх, Ирээдүй хойчийн шударга ёс зэрэг асуудалд Монголын Эмнести Интернэшнл бодлогын байр сууринаас хандаж үйл ажиллагаа явуулахын тулд дотоодын чадамж, гишүүдийнхээ мэдлэг, ойлголтыг нэмэгдүүлэн, сургалт, судалгааны салбарт онцгойлон анхаарах шаардлагатай хэмээн үзэж дээрх салбарт бодитой хувь нэмэр оруулахыг хичээн ажиллаж байна.",
      image: "/images/managers/ochirbal.png",
    },
    {
      id: 2,
      name: "Б. Болдсүрэн",
      position: "Удирдах зөвлөлийн дэд дарга",
      description:
        "Б.Болдсүрэн нь 2009 оноос МЭИ-ийн багш нарын бүлгийн гишүүнээр, 2020 оноос Удирдах зөвлөлийн гишүүнээр ажиллаж байна. Тэрээр МУИС-ийн Боловсрол судлалын тэнхимд багшилдаг бөгөөд ирээдүйд багш болох оюутнуудтай голлон ажилладагийн хувьд хүний эрхийн агуулгыг Багш боловсролын хөтөлбөрийн агуулгад нэгтгэх чиглэлээр манлайлдаг. МЭИ-ийн хүрээнд ЕБС-ийн сурагчдад зориулсан үе тэнгийн хүний эрхийн сургагч багшийн сургалт, Хүүхдэд ээлтэй сургууль, Хүний эрхийн боловсролын кампайнууд дээр ажиллаж ирсэн. Сүүлийн үед АНУ-ын Бараан Вашингтоны ИС-тай хамтран хийсэн уур амьсгалын өөрчлөлтийн малчин иргэдийн нийгэм, сэтгэл зүйд үзүүлж байгаа нөлөөллийн талаарх судалгааны ажлууд нь энэ чиглэлийн кампайнт ажилтай нийцэж байгаа бөгөөд энэ чиглэлээр 3 эрдэм шинжилгээний өгүүлэл ОУ-ын нэр хүнд бүхий сэтгүүлд нийтлүүлж 2 илтгэл хэлэлцүүлээд байна.",
      image: "/images/managers/boldsuren.png",
    },
    {
      id: 3,
      name: "Б. Мөнхжавхлан",
      position: "Удирдах зөвлөлийн гишүүн",
      description:
        "МУИС-ийн философи, шашин судлалын тэнхимийн багш, доктор. 2003 оноос хойш МЭИ-д элсэж, эмэгтэйчүүдийн бүлгийн гишүүн, Хяналтын зөвлөлийн даргаар ажиллаж байсан. 2021 оноос Удирдах зөвлөлийн гишүүн, санхүүчээр ажиллаж байна. Эмэгтэйчүүдийн эрх, хүний эрхийн боловсрол, жендэр, хүрээлэн буй орчны асуудлаар сургалт, судалгааны ажил эрхэлж, хүний эрхийн сургалт, кампанит ажлуудыг зохион явуулдаг.",
      image: "/images/managers/munkhjavhlan.png",
    },
    {
      id: 4,
      name: "Б. Баялагмаа",
      position: "Удирдах зөвлөлийн гишүүн",
      description: `МУИС-ийн Хууль зүйн сургуульд багшаар ажилладаг. Өмгөөллийн Фиделитас партнерс ХХН-ийн партнер, өмгөөлөгч. Эмнестид 2017 оноос Хуульчдын бүлгийн гишүүнээр, 2021 оноос Удирдлах зөвлөлийн гишүүнээр ажиллаж байна. 2018 оноос хойш шаардлагад нийцсэн орон байртай байх эрх ба хот дахин төлөвлөлтийн сэдвээр сургагч багшаар ажиллаж, хууль зүйн про-боно үйлчилгээ үзүүлж ирсэн. 2018 оноос эхлэн "Технологи ба хүний эрх" сэдвийн хүрээнд хүний хувийн мэдээлэл, биометрик мэдээллийг хамгаалах, нийтийн мэдээллийн ил тод байдлын асуудлаар сургалт хийж, цахим хөгжлийн багц хуулийн төсөлд санал өгч, эдгээр хуулиудыг боловсронгуй болгох чиглэлээр судалж, эрх бүхий байгууллага болон Эмнеcтигийн гишүүдтэй санал солилцож хамтран ажиллаж байна.`,
      image: "/images/managers/baylagmaa.png",
    },
    {
      id: 5,
      name: "Д. Оюунномин",
      position: "Удирдах зөвлөлийн гишүүн",
      description:
        "ШУТИС-ийн багш, Сэтгэл зүйч, Доктарант. МЭИ байгууллагын гишүүн болоод 20 жил болж байгаа бөгөөд энэ хугацаанд хорихын боловсрол төсөл, хүний эрхийн боловсрол, эрүүдэн шүүхийн эсрэг ажил, цаазаар авах ялын эсрэг кино хэлэлцүүлэг гээд хүний эрхийн боловсролтой холбоотой бүхий л төсөл хөтөлбөрүүдэд ажиллаж, сургалт хийж, хэлэлцүүлэг өрнүүлж, гарын үсэг цуглуулах ажил хийж байсан. Чөлөөт бүлгийн гишүүн, 2021 оноос эхлэн Удирдах зөвлөлийн гишүүнээр сонгогдон ажиллаж байна.",
      image: "/images/managers/oyunnomin.png",
    },
    {
      id: 6,
      name: "Б. Бадрал",
      position: "Удирдах зөвлөлийн гишүүн",
      description:
        "Монгол Улсын Их сургуулийн хууль зүйн сургуулийн магистрант, эрх зүйч мэргэжилтэй. Эмнестид 2021 оноос удирдах зөвлөлийн гишүүнээр ажиллаж байна. 2019 онд Эмнестигээс бэлтгэсэн орон байртай байх эрхийн эрх зүйн хөтчөөр бэлтгэгдэн иргэдэд зөвлөгөө мэдээлэл өгч ажиллаж байна. Энэ хүрээнд Эмнестигийн Орон байртай байх эрх, эрх зүйн хөтөч подкастыг хөтлөн явуулж, шинээр эрх зүйн хөтөч бэлтгэх сургалтын сургагч багшаар ажиллаж байна.",
      image: "/images/managers/badral.png",
    },
    {
      id: 7,
      name: "Б. Хүслэн",
      position: "Удирдах зөвлөлийн гишүүн",
      description:
        "МСС ХХК-д Ахлах аудитороор ажилладаг. Эмнестид 2017 оноос Залуучуудын бүлгийн гишүүн, Сайн дурын ажилтнаар ажиллаж байна. 2019 оноос хойш Олон улсын сайн менежментийн арга туршлага болох ISO9001:2015 чанарын менежмент, ISO45001:2018 Хөдөлмөрийн аюулгүй байдал, эрүүл ахуйн менежмент, ISO1400:2015 Байгаль орчны менежментийг байгууллагын үйл ажиллагаанд нэвтрүүлэх, хэвшүүлэхээр ажиллаж байна. Энэ хүрээнд бодлогын болон, стратегийн баримт бичиг боловсруулах, хуулийн болон стандартын нийцлийн үнэлгээ хийх, бизнесийн үйл явцыг оновчлох, стандартчилах арга зүй боловсруулах, зөвлөн туслах, эрсдэлийн үнэлгээ болон сайжруулалтын механизм бий болгох, хэвшүүлэх зэрэг ажлуудыг зохион байгуулж, хэрэгжилтийн нийцлийг үнэлж, тогтмол сайжралтад хөтлөх эрмэлзлэлээр баг хамт олонтойгоо хамтран ажилладаг.",
      image: "/images/managers/khuslen.png",
    },
    {
      id: 8,
      name: "М. Нандинцэцэг",
      position: "Удирдах зөвлөлийн гишүүн",
      description:
        "2011 оноос 2013 он хүртэл Хорихоос гарсан хүмүүсийг нийгэмшүүлэх чиглэлээр үйл ажиллагаа явуулдаг Германы Шайдевег нийгэмлэг, Хүүхдийн эрх хамгаалалын чиглэлээр Гүүд Нэйборс ОУТББ-ийн ХИТХ төслийн ажилтанаар ажилласан. 2017 оноос хойш Хүүхдийн эрхийн чиглэлээр олон улсын болон дотоодын хэм хэмжээг төрийн албан хаагчдад таниулах үндэсний хэмжээнд чадавхжуулах сургалтын сургагч багш, судалгааны багт судлаачаар ажиллаж, Хүүхдийн хөгжил хамгаалал үндэсний хөтөлбөрийн ажлын хэсгүүдэд ажилласан туршлагатай. 2009 оноос хойш одоог хүртэл МЭИ-ийн оюутны бүлгийн гишүүн, залуучуудын бүлгийн ахлагчаар сайн дураар ажиллаж ирсэн. Хүний эрхийн 20 гаруй сургалт хамрагдаж сургагч багш болсон бөгөөд давхардсан тоогоор 7000 гаруй хүнд хүний эрхийн боловсрол олгох сургалт орсон. 2023 оны 9 сарын 23-аас эхлэн Удирдах зөвлөлийн гишүүнээр сонгогдон ажиллаж байна.",
      image: "/images/managers/nandintsetseg.png",
    },
    {
      id: 9,
      name: "Б. Идэржав",
      position: "Удирдах зөвлөлийн гишүүн",
      description:
        "Эрүүл мэндийн нийгмийн ажилтан мэргэжилтэй. 2018 онд Философи, хүний эрхийн уулзварт олимпиадад оролцоод Эмнестид гишүүнээр элсэн орсон. Футболкны өдөр, Эрүүдэн шүүхийн эсрэг шог зургийн уралдаан, Нүүрээр таних технологи ба хүний эрх, жагсаал цуглаан ба хүний эрх зэрэг маш олон үйл ажиллагаанд сайн дурын ажилтнаар идэвхтэй оролцож ирсэн.",
      image: "/images/managers/iderjav.png",
    },
  ];

  return (
    <div className="w-full block sm:hidden">
      <div className="relative w-full h-[40vh]">
        <BannerSlider images={bannerImages} width="90rem" />
      </div>
      <div className="flex flex-col gap-12 p-4 h-full">
        <div className="flex gap-2 max-h-[200px]">
          <h2
            className="text-[10px] font-bold"
            style={{
              writingMode: "vertical-lr",
            }}
          >
            ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨ᠋ᠲ᠋ᠧᠷᠨᠧᠱᠢᠨ᠋ᠯ ᠪᠣᠯ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠠᠯᠠᠭᠠᠷᢈᠢ ᠳᠠᠭᠤ
            ᠬᠣᠭᠤᠯᠠᠢ ᠶᠤᠮ᠃ ᠪᠢᠳᠡ ᠖᠐ ᠭᠠᠷᠤᠢ ᠵᠢᠯ ᠦ᠋ᠨ ᠲᠤᠷᠰᠢ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠵᠥᠷᠢᠴᠡᠯ᠂
            ᠣᠯᠠᠨ ᠤᠯᠤᠰ ᠤ᠋ᠨ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠬᠠᠤᠯᠢ ᠲᠣᠭᠲᠠᠭᠠᠮᠵᠢ᠂ ᠰᠲ᠋ᠠᠨ᠋ᠳᠠᠷᠲ ᠤ᠋ᠨ
            ᠲᠠᠯᠠᠭᠠᠷ ᠨᠠᠶᠢᠳᠠᠪᠤᠷᠢᠲᠠᠢ᠂ ᠦᠨᠡᠨ ᠵᠥᠪ ᠮᠡᠳᠡᢉᠡᠯᠡᠯ ᠢ᠋ᠶᠡᠷ ᠳᠡᠯᠡᢈᠡᠢ ᠨᠡᠶᠢᠲᠡ
            ᢈᠦᠷᢉᠡᠰ ᠢ᠋ᠶᠡᠷ ᠢᠷᠡᢉᠰᠡᠨ᠃
          </h2>
          <p
            className="text-[10px] text-[#848382]"
            style={{
              writingMode: "vertical-lr",
            }}
          >
            ᠡᠷᢈᠡ ᠪᠠᠷᠢᠭᠴᠢᠳ ᠣᠯᠠᠨ ᠤᠯᠤᠰ ᠤ᠋ᠨ ᠡᠷᢈᠡ ᠵᠦᠢ᠂ ᢈᠡᠮ ᢈᠡᠮᠵᠢᠶ᠎ᠡ ᠶ᠋ᠢ ᢈᠦᠨᠳᠦᠳᢈᠡᠳᠡᢉ᠂
            ᠬᠠᠷᠢᠭᠤᠴᠠᠯᠭ᠎ᠠ ᠪᠠᠨ ᢈᠦᠯᠢᠶᠡᠳᠡᢉ᠂ ᠠᠮᠠᠯᠠᠯᠲᠠ ᠳ᠋ᠤ ᠪᠠᠨ ᢈᠦᠷᠳᠡᢉ ᠳᠡᠯᠡᢈᠡᠢ ᠶᠢᠷᠲᠢᠨᠴᠦ
            ᠶ᠋ᠢ ᠪᠤᠢ ᠪᠣᠯᠭᠠᠬᠤ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠪᠢᠳᠡ ᠠᠵᠢᠯᠯᠠᠳᠠᠭ᠃
          </p>
        </div>
        <div className="flex gap-2">
          <SectionTitle
            title={"ᠮᠣᠩᠭᠣᠯ ᠤ᠋ᠨ ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠢᠨᠲ᠋ᠧᠷᠨᠡᠱᠢᠨᠯ ᠪᠠᠶᠢᠭᠤᠯᠤᠯᠭ᠎ᠠ ᠶ᠋ᠢᠨ ᠪᠦᠲᠦᠴᠡ"}
            containerClassName={"bg-[#FFFF00] text-[10px]"}
          />
        </div>

        {/* Managers Section */}
        <div className="flex flex-col gap-4">
          <SectionTitle
            title={"ᠦᠳᠢᠷᠳᠠᠭᠰᠡᠨ ᠵᠥᠪᠯᠡᠨ"}
            containerClassName={"bg-[#FFFF00] text-[10px]"}
          />

          <div className="flex flex-col gap-6 overflow-y-auto max-h-[600px] p-2">
            {managers.map((manager, index) => (
              <div
                key={manager.id}
                className="border border-gray-300 rounded-lg overflow-hidden shadow-md"
              >
                {/* Manager Image */}
                <div className="h-48 w-full relative">
                  <Image
                    src={manager.image || "/images/no-image-icon.png"}
                    alt={manager.name}
                    fill
                    className="object-cover"
                  />
                </div>

                {/* Manager Info */}
                <div className="p-4">
                  <h3
                    className="font-bold text-lg mb-2 text-center"
                    style={{
                      writingMode: "vertical-lr",
                      textOrientation: "upright",
                      height: "120px",
                      overflow: "hidden",
                    }}
                  >
                    {manager.name}
                  </h3>
                  <p
                    className="text-sm text-gray-600 text-center mb-3"
                    style={{
                      writingMode: "vertical-lr",
                      textOrientation: "upright",
                      height: "60px",
                      overflow: "hidden",
                    }}
                  >
                    {manager.position}
                  </p>
                  <p
                    className="text-xs text-gray-700 line-clamp-4"
                    style={{
                      writingMode: "vertical-lr",
                      textOrientation: "upright",
                      height: "200px",
                      overflow: "hidden",
                    }}
                  >
                    {manager.description}
                  </p>
                </div>
              </div>
            ))}
          </div>
        </div>
      </div>
    </div>
  );
}
