import BannerSlider from "@/components/common/BannerSlider";
import StaticHeader from "@/components/common/StaticHeader";
import { bannerImages } from "@/constants/bannerImages";

export default function EyeMobile() {
  return (
    <div className="h-full w-full sm:hidden p-4 flex flex-col gap-4">
      <StaticHeader
        image="/images/news1.png"
        alt="Youth Page Header"
        width="100%"
        title="ᠵᠠᠯᠠᠭᠤᠴᠤᠳ ᠤ᠋ᠨ ᠣᠷᠤᠯᠴᠠᠭ᠎ᠠ"
      />
      <div className="h-full w-full flex flex-col gap-4">
        <div className="flex gap-4 max-h-[150px] w-full">
          <p
            className="text-[10px]"
            style={{
              writingMode: "vertical-lr",
              textOrientation: "upright",
            }}
          >
            ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠠᠩᠬᠠᠷᠤᠯ ᠲᠠᠲᠠᠭᠰᠠᠨ ᠠᠰᠠᠭᠤᠳᠠᠯ ᠤ᠋ᠳ ᠢ᠋ ᠡᠷᠢᠯᢈᠢᠯᠡᢈᠦ᠂
            ᠰᠢᠢᠳᠪᠦᠷᠢᠯᠡᢈᠦ ᠠᠷᠭ᠎ᠠ ᠵᠠᠮ ᠢ᠋ ᠲᠣᠳᠤᠷᠬᠠᠶᠢᠯᠠᠬᠤ ᠳ᠋ᠤ ᠢᠷᢉᠡᠳ ᠦ᠋ᠨ ᠣᠷᠤᠯᠴᠠᠭ᠎ᠠ ᠶ᠋ᠢ
            ᠳᠡᠮᠵᠢᢈᠦ ᠵᠣᠷᠢᠯᠭ᠎ᠠ ᠪᠠᠷ ᠶᠠᠪᠤᠭᠤᠯᠵᠤ ᠪᠤᠢ “ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠨᠢᠳᠦ” ᠦᠨᠳᠦᠰᠦᠨ
            ᠦ᠋ ᠮᠡᠳᠡᢉᠡᠯᠡᠯ ᠦ᠋ᠨ ᠮᠠᠷᠠᠹᠤᠨ᠃
          </p>
          <h2
            className="text-xs font-bold"
            style={{
              writingMode: "vertical-lr",
              textOrientation: "upright",
            }}
          >
            ᠶᠠᠭᠠᢈᠢᠭᠰᠠᠨ ᠬᠠᠷᠠᠩᠬᠤᠢ ᠶᠤᠮ ᠪᠤᠢ ᢉᠡᠵᠦ ᠬᠠᠰᢈᠢᠷᠤᠭᠰᠠᠨ ᠠ᠋ᠴᠠ ᠶᠠᠳᠠᠵᠤ ᠨᠢᢉᠡ ᠴᠤ
            ᢉᠡᠰᠡᠨ ᠯᠠ ᠲᠠ ᠥᠪᠡᠷ ᠢ᠋ᠶᠡᠨ ᠠᠰᠠᠭ᠎ᠠ᠃ ᠃ ᠃
          </h2>
        </div>
        <div className="h-full max-h-[150px] flex justify-center items-center gap-4">
          <p
            className="text-xs font-bold"
            style={{
              writingMode: "vertical-lr",
              textOrientation: "upright",
            }}
          >
            ᠮᠣᠩᠭᠣᠯ ᠤᠯᠤᠰ ᠤ᠋ᠨ ᠭᠠᠵᠠᠷ ᠤ᠋ᠨ ᠵᠢᠷᠤᠭ
          </p>
          <img src="/images/mgl-map.png" alt="" className="max-h-[150px]" />
        </div>
        <div className="flex flex-col gap-4 w-full">
          <div className="flex flex-col gap-2">
            <p className="text-[10px]">ᠤᠲᠠᠰᠤᠨ ᠤ᠋ ᠳ᠋ᠤᠭᠠᠷ:</p>
            <input
              type="text"
              className="border border-gray-300 rounded-md p-2 w-full"
            />
          </div>
          <div className="flex flex-col gap-2">
            <p className="text-[10px]">ᠪᠠᠲᠤᠯᠠᠭᠠᠵᠢᠭᠤᠯᠬᠤ ᠻᠣᠳ*</p>
            <input
              type="text"
              className="border border-gray-300 rounded-md p-2 w-full"
            />
          </div>
          <div className="flex flex-col gap-2">
            <p className="text-[10px]">ᠪᠠᠶᠢᠷᠢᠰᠢᠯ*</p>
            <input
              type="text"
              className="border border-gray-300 rounded-md p-2 w-full"
            />
          </div>
          <div className="flex flex-col gap-2">
            <p className="text-[10px]">ᠭᠠᠷᠴᠠᠭ*</p>
            <input
              type="text"
              className="border border-gray-300 rounded-md p-2 w-full"
            />
          </div>
          <div className="flex flex-col gap-2">
            <p className="text-[10px]">ᠻᠣᠸᠧᠷ ᠵᠢᠷᠤᠭ ᠰᠣᠩᠭᠤᠬᠤ*</p>
            <input
              type="text"
              className="border border-gray-300 rounded-md p-2 w-full"
            />
          </div>
          <div className="flex flex-col gap-2">
            <p className="text-[10px]">
              ᠶᠠᠮᠠᠷ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠠᠰᠠᠭᠤᠳᠠᠯ ᠢ᠋ᠶᠠᠷ*
            </p>
            <input
              type="text"
              className="border border-gray-300 rounded-md p-2 w-full"
            />
          </div>
          <div className="flex flex-col gap-2">
            <p className="text-[10px]">ᠮᠧᠰᠰᠧᠵᠢ</p>
            <textarea
              type="text"
              className="border border-gray-300 rounded-md p-2 w-full"
            />
          </div>
        </div>
      </div>
    </div>
  );
}

const volunteerItems = [
  {
    id: 1,
    description:
      "ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠦᠢᠯᠡᠰ ᠲᠦ ᢈᠦᠴᠦ ᠨᠡᠮᠡᠵᠦ ᠠᠵᠢᠯᠯᠠᠳᠠᠭ ᢈᠦᠴᠦᠷᢈᠡᢉ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠦᢉᠡᠢ ᠪᠡᠷ ᠡᠨᠡ ᠲᠡᠮᠡᠴᠡᠯ ᠳ᠋ᠦ ᠠᠮᠵᠢᠯᠲᠠ ᠭᠠᠷᠭᠠᠬᠤ ᠪᠣᠯᠤᠮᠵᠢ ᠦᢉᠡᠢ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠦᠢᠯᠡᠰ ᠢ᠋ ᠲᠥᠯᠦᠪᠰᠢᢉᠦᠯᠵᠦ᠂ ᠤᠳᠤᠷᠢᠳᠴᠤ᠂ ᢈᠡᠷᠡᢉᠵᠢᢉᠦᠯᠳᠡᢉ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᢈᠢᠨ ᠲᠠᠢ ᠠᠩᠬᠠᠨ ᠱᠠᠲᠤᠨ ᠤ᠋ ᢉᠡᠰᠢᢉᠦᠨᠴᠢᠯᠡᠯ ᠦ᠋ᠨ ᠪᠠᠶᠢᠭᠤᠯᠤᠯᠭ᠎ᠠ ᠶᠤᠮ᠃ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷ ᠑᠐ ᠰᠠᠶ᠋ᠢ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ ᠲᠡᠢ ᠪᠥᢉᠡᠳ ᠲᠡᠳᠡᠨ ᠦ᠋ ᠑᠐᠐᠐᠐ ᠭᠠᠷᠤᠢ ᠨᠢ ᠮᠣᠩᠭᠣᠯ ᠳ᠋ᠤ ᠪᠠᠶᠢᠳᠠᠭ᠃  ᠲᠡᠳᠡ ᠵᠠᢈᠢᠳᠠᠯ ᠤᠷᠢᠶᠠᠯᠭ᠎ᠠ ᠳ᠋ᠤ ᠭᠠᠷ ᠤ᠋ᠨ ᠦᠰᠦᢉ ᠴᠤᠭᠯᠠᠭᠤᠯᠬᠤ ᠠ᠋ᠴᠠ ᠡᢈᠢᠯᠡᢉᠡᠳ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡᢈᠦ ᠦᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠵᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠳ᠋ᠤ ᠪᠤᠰᠤᠳ ᠢ᠋ ᠤᠷᠢᠶᠠᠯᠠᠵᠤ᠂ ᠮᠡᠳᠡᠯᢉᠡ ᠲᠦᢉᠡᢉᠡᠵᠦ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠡᠪᠯᠡᠯᠳᠦᠨ ᠨᠢᢉᠡᠳᠦᢉᠰᠡᠨ ᠡᠳᠡᢉᠡᠷ ᢈᠦᠮᠦᠰ ᠪᠣᠯ ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠶ᠋ᠢᠨ ᠬᠠᠮᠤᠭ ᠤ᠋ᠨ ᠲᠣᠮᠤ ᢈᠦᠴᠦ ᠶᠤᠮ᠃  ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯᠲᠠᠨ ᠪᠣᠯᠤᠭᠰᠠᠨ ᠢ᠋ᠶᠠᠷ ᠤᠷ᠎ᠠ ᠴᠢᠳᠠᠪᠤᠷᠢ ᠡᠵᠡᠮᠰᠢᠵᠦ᠂ ᠰᠢᠨ᠎ᠡ ᢈᠦᠮᠦᠰ ᠲᠡᠢ ᠲᠠᠨᠢᠯᠴᠠᠬᠤ - ᠥᠨᠦᠳᠦᠷ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯ ᢈᠢᠵᠦ᠂ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷ ᠪᠢᠳᠡᠨ ᠦ᠋ ᠠᠵᠢᠯ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ ᠪᠣᠯᠤᠮᠵᠢ ᠲᠠᠢ᠃  ᠳᠣᠯᠤᠭ᠎ᠠ ᠬᠣᠨᠤᠭ ᠲᠤ ᢈᠡᠳᠦᠨ ᠮᠢᠨᠦ᠋ᠲ ᠴᠤ ᠪᠠᠢ᠂ ᢈᠡᠳᠦᠨ ᠴᠠᠭ ᠴᠤ ᠪᠠᠢ ᠲᠠ ᠮᠠᠨ ᠤ᠋ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡᢈᠦ ᠠᠵᠢᠯ ᠤ᠋ᠨ ᠨᠢᢉᠡ ᢈᠡᠰᠡᢉ ᠪᠣᠯᠵᠤ ᠴᠢᠳᠠᠨ᠎ᠠ᠃",
  },
  {
    id: 2,
    title: "᠑᠐᠐ ᠴᠠᠭ ᠤ᠋ᠨ ᠰᠧᠷᠲ᠋ᠢᠹᠢᠻᠠᠲ ᠲᠠᠢ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯ ᠤ᠋ᠨ ᢈᠥᠲᠦᠯᠪᠦᠷᠢ",
    description:
      "ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠦᠢᠯᠡᠰ ᠲᠦ ᢈᠦᠴᠦ ᠨᠡᠮᠡᠵᠦ ᠠᠵᠢᠯᠯᠠᠳᠠᠭ ᢈᠦᠴᠦᠷᢈᠡᢉ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠦᢉᠡᠢ ᠪᠡᠷ ᠡᠨᠡ ᠲᠡᠮᠡᠴᠡᠯ ᠳ᠋ᠦ ᠠᠮᠵᠢᠯᠲᠠ ᠭᠠᠷᠭᠠᠬᠤ ᠪᠣᠯᠤᠮᠵᠢ ᠦᢉᠡᠢ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠦᠢᠯᠡᠰ ᠢ᠋ ᠲᠥᠯᠦᠪᠰᠢᢉᠦᠯᠵᠦ᠂ ᠤᠳᠤᠷᠢᠳᠴᠤ᠂ ᢈᠡᠷᠡᢉᠵᠢᢉᠦᠯᠳᠡᢉ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᢈᠢᠨ ᠲᠠᠢ ᠠᠩᠬᠠᠨ ᠱᠠᠲᠤᠨ ᠤ᠋ ᢉᠡᠰᠢᢉᠦᠨᠴᠢᠯᠡᠯ ᠦ᠋ᠨ ᠪᠠᠶᠢᠭᠤᠯᠤᠯᠭ᠎ᠠ ᠶᠤᠮ᠃ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷ ᠑᠐ ᠰᠠᠶ᠋ᠢ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ ᠲᠡᠢ ᠪᠥᢉᠡᠳ ᠲᠡᠳᠡᠨ ᠦ᠋ ᠑᠐᠐᠐᠐ ᠭᠠᠷᠤᠢ ᠨᠢ ᠮᠣᠩᠭᠣᠯ ᠳ᠋ᠤ ᠪᠠᠶᠢᠳᠠᠭ᠃  ᠲᠡᠳᠡ ᠵᠠᢈᠢᠳᠠᠯ ᠤᠷᠢᠶᠠᠯᠭ᠎ᠠ ᠳ᠋ᠤ ᠭᠠᠷ ᠤ᠋ᠨ ᠦᠰᠦᢉ ᠴᠤᠭᠯᠠᠭᠤᠯᠬᠤ ᠠ᠋ᠴᠠ ᠡᢈᠢᠯᠡᢉᠡᠳ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡᢈᠦ ᠦᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠵᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠳ᠋ᠤ ᠪᠤᠰᠤᠳ ᠢ᠋ ᠤᠷᠢᠶᠠᠯᠠᠵᠤ᠂ ᠮᠡᠳᠡᠯᢉᠡ ᠲᠦᢉᠡᢉᠡᠵᠦ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠡᠪᠯᠡᠯᠳᠦᠨ ᠨᠢᢉᠡᠳᠦᢉᠰᠡᠨ ᠡᠳᠡᢉᠡᠷ ᢈᠦᠮᠦᠰ ᠪᠣᠯ ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠶ᠋ᠢᠨ ᠬᠠᠮᠤᠭ ᠤ᠋ᠨ ᠲᠣᠮᠤ ᢈᠦᠴᠦ ᠶᠤᠮ᠃  ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯᠲᠠᠨ ᠪᠣᠯᠤᠭᠰᠠᠨ ᠢ᠋ᠶᠠᠷ ᠤᠷ᠎ᠠ ᠴᠢᠳᠠᠪᠤᠷᠢ ᠡᠵᠡᠮᠰᠢᠵᠦ᠂ ᠰᠢᠨ᠎ᠡ ᢈᠦᠮᠦᠰ ᠲᠡᠢ ᠲᠠᠨᠢᠯᠴᠠᠬᠤ - ᠥᠨᠦᠳᠦᠷ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯ ᢈᠢᠵᠦ᠂ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷ ᠪᠢᠳᠡᠨ ᠦ᠋ ᠠᠵᠢᠯ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ ᠪᠣᠯᠤᠮᠵᠢ ᠲᠠᠢ᠃  ᠳᠣᠯᠤᠭ᠎ᠠ ᠬᠣᠨᠤᠭ ᠲᠤ ᢈᠡᠳᠦᠨ ᠮᠢᠨᠦ᠋ᠲ ᠴᠤ ᠪᠠᠢ᠂ ᢈᠡᠳᠦᠨ ᠴᠠᠭ ᠴᠤ ᠪᠠᠢ ᠲᠠ ᠮᠠᠨ ᠤ᠋ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡᢈᠦ ᠠᠵᠢᠯ ᠤ᠋ᠨ ᠨᠢᢉᠡ ᢈᠡᠰᠡᢉ ᠪᠣᠯᠵᠤ ᠴᠢᠳᠠᠨ᠎ᠠ᠃",
  },
  {
    id: 3,
    title: "᠑᠐᠐ ᠴᠠᠭ ᠤ᠋ᠨ ᠰᠧᠷᠲ᠋ᠢᠹᠢᠻᠠᠲ ᠲᠠᠢ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯ ᠤ᠋ᠨ ᢈᠥᠲᠦᠯᠪᠦᠷᠢ",
    description:
      "ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠦᠢᠯᠡᠰ ᠲᠦ ᢈᠦᠴᠦ ᠨᠡᠮᠡᠵᠦ ᠠᠵᠢᠯᠯᠠᠳᠠᠭ ᢈᠦᠴᠦᠷᢈᠡᢉ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠦᢉᠡᠢ ᠪᠡᠷ ᠡᠨᠡ ᠲᠡᠮᠡᠴᠡᠯ ᠳ᠋ᠦ ᠠᠮᠵᠢᠯᠲᠠ ᠭᠠᠷᠭᠠᠬᠤ ᠪᠣᠯᠤᠮᠵᠢ ᠦᢉᠡᠢ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠦᠢᠯᠡᠰ ᠢ᠋ ᠲᠥᠯᠦᠪᠰᠢᢉᠦᠯᠵᠦ᠂ ᠤᠳᠤᠷᠢᠳᠴᠤ᠂ ᢈᠡᠷᠡᢉᠵᠢᢉᠦᠯᠳᠡᢉ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᢈᠢᠨ ᠲᠠᠢ ᠠᠩᠬᠠᠨ ᠱᠠᠲᠤᠨ ᠤ᠋ ᢉᠡᠰᠢᢉᠦᠨᠴᠢᠯᠡᠯ ᠦ᠋ᠨ ᠪᠠᠶᠢᠭᠤᠯᠤᠯᠭ᠎ᠠ ᠶᠤᠮ᠃ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷ ᠑᠐ ᠰᠠᠶ᠋ᠢ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ ᠲᠡᠢ ᠪᠥᢉᠡᠳ ᠲᠡᠳᠡᠨ ᠦ᠋ ᠑᠐᠐᠐᠐ ᠭᠠᠷᠤᠢ ᠨᠢ ᠮᠣᠩᠭᠣᠯ ᠳ᠋ᠤ ᠪᠠᠶᠢᠳᠠᠭ᠃  ᠲᠡᠳᠡ ᠵᠠᢈᠢᠳᠠᠯ ᠤᠷᠢᠶᠠᠯᠭ᠎ᠠ ᠳ᠋ᠤ ᠭᠠᠷ ᠤ᠋ᠨ ᠦᠰᠦᢉ ᠴᠤᠭᠯᠠᠭᠤᠯᠬᠤ ᠠ᠋ᠴᠠ ᠡᢈᠢᠯᠡᢉᠡᠳ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡᢈᠦ ᠦᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠵᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠳ᠋ᠤ ᠪᠤᠰᠤᠳ ᠢ᠋ ᠤᠷᠢᠶᠠᠯᠠᠵᠤ᠂ ᠮᠡᠳᠡᠯᢉᠡ ᠲᠦᢉᠡᢉᠡᠵᠦ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠡᠪᠯᠡᠯᠳᠦᠨ ᠨᠢᢉᠡᠳᠦᢉᠰᠡᠨ ᠡᠳᠡᢉᠡᠷ ᢈᠦᠮᠦᠰ ᠪᠣᠯ ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠶ᠋ᠢᠨ ᠬᠠᠮᠤᠭ ᠤ᠋ᠨ ᠲᠣᠮᠤ ᢈᠦᠴᠦ ᠶᠤᠮ᠃  ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯᠲᠠᠨ ᠪᠣᠯᠤᠭᠰᠠᠨ ᠢ᠋ᠶᠠᠷ ᠤᠷ᠎ᠠ ᠴᠢᠳᠠᠪᠤᠷᠢ ᠡᠵᠡᠮᠰᠢᠵᠦ᠂ ᠰᠢᠨ᠎ᠡ ᢈᠦᠮᠦᠰ ᠲᠡᠢ ᠲᠠᠨᠢᠯᠴᠠᠬᠤ - ᠥᠨᠦᠳᠦᠷ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯ ᢈᠢᠵᠦ᠂ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷ ᠪᠢᠳᠡᠨ ᠦ᠋ ᠠᠵᠢᠯ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ ᠪᠣᠯᠤᠮᠵᠢ ᠲᠠᠢ᠃  ᠳᠣᠯᠤᠭ᠎ᠠ ᠬᠣᠨᠤᠭ ᠲᠤ ᢈᠡᠳᠦᠨ ᠮᠢᠨᠦ᠋ᠲ ᠴᠤ ᠪᠠᠢ᠂ ᢈᠡᠳᠦᠨ ᠴᠠᠭ ᠴᠤ ᠪᠠᠢ ᠲᠠ ᠮᠠᠨ ᠤ᠋ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡᢈᠦ ᠠᠵᠢᠯ ᠤ᠋ᠨ ᠨᠢᢉᠡ ᢈᠡᠰᠡᢉ ᠪᠣᠯᠵᠤ ᠴᠢᠳᠠᠨ᠎ᠠ᠃",
  },
  {
    id: 4,
    title: "᠑᠐᠐ ᠴᠠᠭ ᠤ᠋ᠨ ᠰᠧᠷᠲ᠋ᠢᠹᠢᠻᠠᠲ ᠲᠠᠢ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯ ᠤ᠋ᠨ ᢈᠥᠲᠦᠯᠪᠦᠷᠢ",
    description:
      "ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠦᠢᠯᠡᠰ ᠲᠦ ᢈᠦᠴᠦ ᠨᠡᠮᠡᠵᠦ ᠠᠵᠢᠯᠯᠠᠳᠠᠭ ᢈᠦᠴᠦᠷᢈᠡᢉ ᠬᠤᠪᠢ ᢈᠦᠮᠦᠰ ᠦᢉᠡᠢ ᠪᠡᠷ ᠡᠨᠡ ᠲᠡᠮᠡᠴᠡᠯ ᠳ᠋ᠦ ᠠᠮᠵᠢᠯᠲᠠ ᠭᠠᠷᠭᠠᠬᠤ ᠪᠣᠯᠤᠮᠵᠢ ᠦᢉᠡᠢ᠃  ᠪᠢᠳᠡ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠦᠢᠯᠡᠰ ᠢ᠋ ᠲᠥᠯᠦᠪᠰᠢᢉᠦᠯᠵᠦ᠂ ᠤᠳᠤᠷᠢᠳᠴᠤ᠂ ᢈᠡᠷᠡᢉᠵᠢᢉᠦᠯᠳᠡᢉ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᢈᠢᠨ ᠲᠠᠢ ᠠᠩᠬᠠᠨ ᠱᠠᠲᠤᠨ ᠤ᠋ ᢉᠡᠰᠢᢉᠦᠨᠴᠢᠯᠡᠯ ᠦ᠋ᠨ ᠪᠠᠶᠢᠭᠤᠯᠤᠯᠭ᠎ᠠ ᠶᠤᠮ᠃ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷ ᠑᠐ ᠰᠠᠶ᠋ᠢ ᠭᠠᠷᠤᠢ ᢉᠡᠰᠢᢉᠦᠳ᠂ ᠳᠡᠮᠵᠢᢉᠴᠢᠳ ᠲᠡᠢ ᠪᠥᢉᠡᠳ ᠲᠡᠳᠡᠨ ᠦ᠋ ᠑᠐᠐᠐᠐ ᠭᠠᠷᠤᠢ ᠨᠢ ᠮᠣᠩᠭᠣᠯ ᠳ᠋ᠤ ᠪᠠᠶᠢᠳᠠᠭ᠃  ᠲᠡᠳᠡ ᠵᠠᢈᠢᠳᠠᠯ ᠤᠷᠢᠶᠠᠯᠭ᠎ᠠ ᠳ᠋ᠤ ᠭᠠᠷ ᠤ᠋ᠨ ᠦᠰᠦᢉ ᠴᠤᠭᠯᠠᠭᠤᠯᠬᠤ ᠠ᠋ᠴᠠ ᠡᢈᠢᠯᠡᢉᠡᠳ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡᢈᠦ ᠦᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠵᠦ᠂ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢ ᠬᠠᠮᠠᠭᠠᠯᠠᠬᠤ ᠳ᠋ᠤ ᠪᠤᠰᠤᠳ ᠢ᠋ ᠤᠷᠢᠶᠠᠯᠠᠵᠤ᠂ ᠮᠡᠳᠡᠯᢉᠡ ᠲᠦᢉᠡᢉᠡᠵᠦ ᠲᠠᠰᠤᠷᠠᠯᠲᠠ ᠦᢉᠡᠢ ᠦᠶᠢᠯᠡ ᠠᠵᠢᠯᠯᠠᠭ᠎ᠠ ᠥᠷᠨᠢᢉᠦᠯᠦᢉᠰᠡᢉᠡᠷ ᠪᠠᠶᠢᠨ᠎ᠠ᠃  ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡ ᠡᠪᠯᠡᠯᠳᠦᠨ ᠨᠢᢉᠡᠳᠦᢉᠰᠡᠨ ᠡᠳᠡᢉᠡᠷ ᢈᠦᠮᠦᠰ ᠪᠣᠯ ᠡᠮᠨᠧᠰᠲ᠋ᠢ ᠶ᠋ᠢᠨ ᠬᠠᠮᠤᠭ ᠤ᠋ᠨ ᠲᠣᠮᠤ ᢈᠦᠴᠦ ᠶᠤᠮ᠃  ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯᠲᠠᠨ ᠪᠣᠯᠤᠭᠰᠠᠨ ᠢ᠋ᠶᠠᠷ ᠤᠷ᠎ᠠ ᠴᠢᠳᠠᠪᠤᠷᠢ ᠡᠵᠡᠮᠰᠢᠵᠦ᠂ ᠰᠢᠨ᠎ᠡ ᢈᠦᠮᠦᠰ ᠲᠡᠢ ᠲᠠᠨᠢᠯᠴᠠᠬᠤ - ᠥᠨᠦᠳᠦᠷ ᠰᠠᠶᠢᠨ ᠳᠤᠷ᠎ᠠ ᠶ᠋ᠢᠨ ᠠᠵᠢᠯ ᢈᠢᠵᠦ᠂ ᠳᠡᠯᠡᢈᠡᠢ ᠳᠠᠶᠠᠭᠠᠷ ᠪᠢᠳᠡᠨ ᠦ᠋ ᠠᠵᠢᠯ ᠢ᠋ ᠳᠡᠮᠵᠢᢈᠦ ᠪᠣᠯᠤᠮᠵᠢ ᠲᠠᠢ᠃  ᠳᠣᠯᠤᠭ᠎ᠠ ᠬᠣᠨᠤᠭ ᠲᠤ ᢈᠡᠳᠦᠨ ᠮᠢᠨᠦ᠋ᠲ ᠴᠤ ᠪᠠᠢ᠂ ᢈᠡᠳᠦᠨ ᠴᠠᠭ ᠴᠤ ᠪᠠᠢ ᠲᠠ ᠮᠠᠨ ᠤ᠋ ᢈᠦᠮᠦᠨ ᠦ᠋ ᠡᠷᢈᠡ ᠶ᠋ᠢᠨ ᠲᠥᠯᠦᢉᠡᢈᠦ ᠠᠵᠢᠯ ᠤ᠋ᠨ ᠨᠢᢉᠡ ᢈᠡᠰᠡᢉ ᠪᠣᠯᠵᠤ ᠴᠢᠳᠠᠨ᠎ᠠ᠃",
  },
];
